LEXICON_ADMIN: dict[str, str] = {
    'success': 'Операция успешно завершена ✅',
    '/cancel1': 'Процесс добавления/изменения/удаления ещё не запущен 👀',
    '/cancel2': 'Операция приостановлена. ⛔️ Чтобы начать сначала, введите нужную команду снова',
    'fill_title': 'Введите название новой статьи ✏️',
    'fill_emoji': 'Отправьте смайлик к статье (он должен ассоциироваться с названием статьи) 🤪',
    'fill_link': 'Отправьте ссылку на статью 🔗',
    'fill_keywords': 'Отправьте ключевые слова через запятую с пробелами 🔎',
    'fill_section': 'Выберите на клавиатуре один из существующих разделов или введите название нового 🗂',
    'fill_position': 'Выберите на клавиатуре номер позиции, на которую надо поместить статью. 🔢 Текущие статьи '
                     'раздела:',
    'fill_is_available': 'Выберите на клавиатуре, сделать ли статью доступной для пользователей 🔑',
    'warning_keyboard': '⚠️ Для ответа на предыдущее сообщение воспользуйтесь специальной клавиатурой ⚠️',
    'check_data': 'Проверьте правильность введённых данных 🛂'
}

LEXICON_COMMANDS_ADMIN: dict[str, str] = {
    '/addlang': 'Добавить язык программирования',
    '/lang': 'Сменить редактируемый язык',
    '/addarticle': 'Добавить статью',
    '/editarticle': 'Редактировать статью',
    '/orderarticle': 'Изменить порядок статей'
}

LEXICON_KEYBOARDS_ADMIN: dict[str, str] = {
    'available_button': 'Открыть доступ ✅',
    'not_available_button': 'Закрыть доступ ❌',
    'allow_publishing_button': 'Опубликовать ✅',
    'not_allow_publishing_button': 'Отменить ❌'
}
